[Survived] ArrowFunction
src/common/app-content/app-content.tsx:6:25
 import { Routes, Route } from 'react-router-dom';
 import { AppRoutes } from '../routes';
 
-const GameScreen = lazy(() => import('../../features/game/game-screen'));
+const GameScreen = lazy(() => undefined);
 const RulesScreen = lazy(() => import('../../features/rules/rules-screen'));
 

[Survived] ArrowFunction
src/common/app-content/app-content.tsx:7:26
 import { AppRoutes } from '../routes';
 
 const GameScreen = lazy(() => import('../../features/game/game-screen'));
-const RulesScreen = lazy(() => import('../../features/rules/rules-screen'));
+const RulesScreen = lazy(() => undefined);
 
 const AppContent: FC = () => {

[Survived] BlockStatement
src/common/app-content/app-content.tsx:9:30
 const GameScreen = lazy(() => import('../../features/game/game-screen'));
 const RulesScreen = lazy(() => import('../../features/rules/rules-screen'));
 
-const AppContent: FC = () => {
-  return (
-    <Suspense>
-      <ErrorBoundary>
-        <Routes>
-          <Route path={AppRoutes.Any} element={<div>Страница 404</div>} />
-          <Route path={AppRoutes.Index} element={<GameScreen />} />
-          <Route path={AppRoutes.Rules} element={<RulesScreen />} />
-        </Routes>
-      </ErrorBoundary>
-    </Suspense>
-  );
-};
+const AppContent: FC = () => {};
 
 export default AppContent;
