[Survived] BooleanLiteral
common/pages/login-page/login-page.tsx:23:44
   const [password, setPassword] = useState('');
   const [nameError, setNameError] = useState('');
   const [passwordError, setPasswordError] = useState('');
-  const [loadAuth, setLoadAuth] = useState(false);
+  const [loadAuth, setLoadAuth] = useState(true);
 
   const handleChangeInputValues = (e: ChangeEvent<HTMLInputElement>) => {

[Killed] BlockStatement
common/pages/login-page/login-page.tsx:25:73
   const [passwordError, setPasswordError] = useState('');
   const [loadAuth, setLoadAuth] = useState(false);
 
-  const handleChangeInputValues = (e: ChangeEvent<HTMLInputElement>) => {
-    const { name, value } = e.currentTarget;
-    if (name === FieldsNames.Name) {
-      setName(value);
-      setNameError('');
-    }
-    if (name === FieldsNames.Password) {
-      setPassword(value);
-      setPasswordError('');
-    }
-  };
+  const handleChangeInputValues = (e: ChangeEvent<HTMLInputElement>) => {};
 
   const handleAuth = () => {
killedBy: LoginPage should auth after click button
statusReason: Error: expect(element).toHaveValue(admin)

Expected the element to have value:
  admin
Received:

[Killed] BlockStatement
common/pages/login-page/login-page.tsx:27:36
 
   const handleChangeInputValues = (e: ChangeEvent<HTMLInputElement>) => {
     const { name, value } = e.currentTarget;
-    if (name === FieldsNames.Name) {
-      setName(value);
-      setNameError('');
-    }
+    if (name === FieldsNames.Name) {}
     if (name === FieldsNames.Password) {
       setPassword(value);
killedBy: LoginPage should auth after click button
statusReason: Error: expect(element).toHaveValue(admin)

Expected the element to have value:
  admin
Received:

[Killed] ConditionalExpression
common/pages/login-page/login-page.tsx:27:9
 
   const handleChangeInputValues = (e: ChangeEvent<HTMLInputElement>) => {
     const { name, value } = e.currentTarget;
-    if (name === FieldsNames.Name) {
+    if (false) {
       setName(value);
       setNameError('');
killedBy: LoginPage should auth after click button
statusReason: Error: expect(element).toHaveValue(admin)

Expected the element to have value:
  admin
Received:

[Killed] ConditionalExpression
common/pages/login-page/login-page.tsx:31:9
       setName(value);
       setNameError('');
     }
-    if (name === FieldsNames.Password) {
+    if (true) {
       setPassword(value);
       setPasswordError('');
killedBy: LoginPage should auth after click button
statusReason: Error: expect(element).toHaveValue(admin)

Expected the element to have value:
  admin
Received:
  adminadmin

[Killed] BlockStatement
common/pages/login-page/login-page.tsx:31:40
       setName(value);
       setNameError('');
     }
-    if (name === FieldsNames.Password) {
-      setPassword(value);
-      setPasswordError('');
-    }
+    if (name === FieldsNames.Password) {}
   };
 
killedBy: LoginPage should auth after click button
statusReason: Error: expect(element).toHaveValue(admin)

Expected the element to have value:
  admin
Received:

[Survived] StringLiteral
common/pages/login-page/login-page.tsx:33:24
     }
     if (name === FieldsNames.Password) {
       setPassword(value);
-      setPasswordError('');
+      setPasswordError("Stryker was here!");
     }
   };

[Survived] MethodExpression
common/pages/login-page/login-page.tsx:38:25
   };
 
   const handleAuth = () => {
-    const nameTrimmed = name.trim();
+    const nameTrimmed = name;
     const passwordTrimmed = password.trim();
     let isInvalid = false;

[Survived] MethodExpression
common/pages/login-page/login-page.tsx:39:29
 
   const handleAuth = () => {
     const nameTrimmed = name.trim();
-    const passwordTrimmed = password.trim();
+    const passwordTrimmed = password;
     let isInvalid = false;
 

[Killed] BooleanLiteral
common/pages/login-page/login-page.tsx:40:21
   const handleAuth = () => {
     const nameTrimmed = name.trim();
     const passwordTrimmed = password.trim();
-    let isInvalid = false;
+    let isInvalid = true;
 
     if (!nameTrimmed) {
killedBy: LoginPage should auth after click button
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="vp-button-spinner"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div

[Killed] ConditionalExpression
common/pages/login-page/login-page.tsx:42:9
     const passwordTrimmed = password.trim();
     let isInvalid = false;
 
-    if (!nameTrimmed) {
+    if (true) {
       isInvalid = true;
       setNameError(ValidationErrors.FieldRequired);
killedBy: LoginPage should auth after click button
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="vp-button-spinner"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div

[Killed] BlockStatement
common/pages/login-page/login-page.tsx:42:23
     const passwordTrimmed = password.trim();
     let isInvalid = false;
 
-    if (!nameTrimmed) {
-      isInvalid = true;
-      setNameError(ValidationErrors.FieldRequired);
-    }
+    if (!nameTrimmed) {}
     if (!passwordTrimmed) {
       isInvalid = true;
killedBy: LoginPage should return validation errors on inputs
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<pre>Необходимо заполнить данное поле</pre>]

[Survived] BooleanLiteral
common/pages/login-page/login-page.tsx:43:19
     let isInvalid = false;
 
     if (!nameTrimmed) {
-      isInvalid = true;
+      isInvalid = false;
       setNameError(ValidationErrors.FieldRequired);
     }

[Killed] BooleanLiteral
common/pages/login-page/login-page.tsx:46:9
       isInvalid = true;
       setNameError(ValidationErrors.FieldRequired);
     }
-    if (!passwordTrimmed) {
+    if (passwordTrimmed) {
       isInvalid = true;
       setPasswordError(ValidationErrors.FieldRequired);
killedBy: LoginPage should return validation errors on inputs
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<pre>Необходимо заполнить данное поле</pre>]

[Killed] BlockStatement
common/pages/login-page/login-page.tsx:46:27
       isInvalid = true;
       setNameError(ValidationErrors.FieldRequired);
     }
-    if (!passwordTrimmed) {
-      isInvalid = true;
-      setPasswordError(ValidationErrors.FieldRequired);
-    }
+    if (!passwordTrimmed) {}
 
     if (isInvalid) return;
killedBy: LoginPage should return validation errors on inputs
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<pre>Необходимо заполнить данное поле</pre>]

[Survived] BooleanLiteral
common/pages/login-page/login-page.tsx:47:19
       setNameError(ValidationErrors.FieldRequired);
     }
     if (!passwordTrimmed) {
-      isInvalid = true;
+      isInvalid = false;
       setPasswordError(ValidationErrors.FieldRequired);
     }

[Killed] ConditionalExpression
common/pages/login-page/login-page.tsx:51:9
       setPasswordError(ValidationErrors.FieldRequired);
     }
 
-    if (isInvalid) return;
+    if (true) return;
 
     setLoadAuth(true);
killedBy: LoginPage should auth after click button
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="vp-button-spinner"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div

[Survived] ConditionalExpression
common/pages/login-page/login-page.tsx:51:9
       setPasswordError(ValidationErrors.FieldRequired);
     }
 
-    if (isInvalid) return;
+    if (false) return;
 
     setLoadAuth(true);

[Killed] BooleanLiteral
common/pages/login-page/login-page.tsx:53:17
 
     if (isInvalid) return;
 
-    setLoadAuth(true);
+    setLoadAuth(false);
     const data: AuthenticationData = {
       name: nameTrimmed,
killedBy: LoginPage should auth after click button
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="vp-button-spinner"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div

[Killed] ObjectLiteral
common/pages/login-page/login-page.tsx:54:38
     if (isInvalid) return;
 
     setLoadAuth(true);
-    const data: AuthenticationData = {
-      name: nameTrimmed,
-      password: passwordTrimmed,
-    };
+    const data: AuthenticationData = {};
     setTimeout(async () => {
       await dispatch(login(data));
killedBy: LoginPage should auth after click button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "admin"
Received: undefined

[Killed] BlockStatement
common/pages/login-page/login-page.tsx:58:28
       name: nameTrimmed,
       password: passwordTrimmed,
     };
-    setTimeout(async () => {
-      await dispatch(login(data));
-      setLoadAuth(false);
-    }, 2000);
+    setTimeout(async () => {}, 2000);
   };
 
killedBy: LoginPage should auth after click button
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] BooleanLiteral
common/pages/login-page/login-page.tsx:60:19
     };
     setTimeout(async () => {
       await dispatch(login(data));
-      setLoadAuth(false);
+      setLoadAuth(true);
     }, 2000);
   };
