[Killed] ArrowFunction
src/common/common-utils/index.ts:4:41
 import { RootState } from '@/app/store';
 import { LocalStorageKeys } from '../common-consts';
 
-export const getStateFromLocalStorage = (): Partial<RootState> => ({
-  system: {
-    version: '',
-    isAuth: !!localStorage.getItem(LocalStorageKeys.Authenticate) || false,
-    userName: localStorage.getItem(LocalStorageKeys.UserName) || '',
-  },
-});
+export const getStateFromLocalStorage = () => undefined;
 
killedBy: App should render main page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-header-user-name-label"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div

[Killed] ObjectLiteral
src/common/common-utils/index.ts:4:68
 import { RootState } from '@/app/store';
 import { LocalStorageKeys } from '../common-consts';
 
-export const getStateFromLocalStorage = (): Partial<RootState> => ({
-  system: {
-    version: '',
-    isAuth: !!localStorage.getItem(LocalStorageKeys.Authenticate) || false,
-    userName: localStorage.getItem(LocalStorageKeys.UserName) || '',
-  },
-});
+export const getStateFromLocalStorage = (): Partial<RootState> => ({});
 
killedBy: App should render main page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-header-user-name-label"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div

[Killed] ObjectLiteral
src/common/common-utils/index.ts:5:11
 import { LocalStorageKeys } from '../common-consts';
 
 export const getStateFromLocalStorage = (): Partial<RootState> => ({
-  system: {
-    version: '',
-    isAuth: !!localStorage.getItem(LocalStorageKeys.Authenticate) || false,
-    userName: localStorage.getItem(LocalStorageKeys.UserName) || '',
-  },
+  system: {},
 });
 
killedBy: App should render main page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-header-user-name-label"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div

[Survived] StringLiteral
src/common/common-utils/index.ts:6:14
 
 export const getStateFromLocalStorage = (): Partial<RootState> => ({
   system: {
-    version: '',
+    version: "Stryker was here!",
     isAuth: !!localStorage.getItem(LocalStorageKeys.Authenticate) || false,
     userName: localStorage.getItem(LocalStorageKeys.UserName) || '',

[Killed] BooleanLiteral
src/common/common-utils/index.ts:7:14
 export const getStateFromLocalStorage = (): Partial<RootState> => ({
   system: {
     version: '',
-    isAuth: !!localStorage.getItem(LocalStorageKeys.Authenticate) || false,
+    isAuth: !localStorage.getItem(LocalStorageKeys.Authenticate) || false,
     userName: localStorage.getItem(LocalStorageKeys.UserName) || '',
   },
killedBy: App should render main page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-header-user-name-label"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div

[Killed] LogicalOperator
src/common/common-utils/index.ts:8:15
   system: {
     version: '',
     isAuth: !!localStorage.getItem(LocalStorageKeys.Authenticate) || false,
-    userName: localStorage.getItem(LocalStorageKeys.UserName) || '',
+    userName: localStorage.getItem(LocalStorageKeys.UserName) && '',
   },
 });
killedBy: App should render main page
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  admin
Received:

[Killed] ConditionalExpression
src/common/common-utils/index.ts:8:15
   system: {
     version: '',
     isAuth: !!localStorage.getItem(LocalStorageKeys.Authenticate) || false,
-    userName: localStorage.getItem(LocalStorageKeys.UserName) || '',
+    userName: false,
   },
 });
killedBy: App should render main page
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  admin
Received:
