[Killed] BooleanLiteral
src/common/error-boundary/error-boundary.tsx:13:15
 
 class ErrorBoundary extends Component<Props, State> {
   state = {
-    hasError: false,
+    hasError: true,
   };
 
killedBy: App should render main page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-header-user-name-label"]

Ignored nodes: comments, script, style
<body>
  <div>
    <span>
      Произошла ошибка
    </span>

[Killed] BlockStatement
src/common/error-boundary/error-boundary.tsx:22:12
 
   componentDidCatch(error: Error, errorInfo: ErrorInfo): void {}
 
-  render() {
-    const { children } = this.props;
-    const { hasError } = this.state;
-
-    return hasError ? <span>Произошла ошибка</span> : children;
-  }
+  render() {}
 }
 
killedBy: App should render main page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-header-user-name-label"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
