[NoCoverage] ObjectLiteral
src/common/vp-button/vp-button.stories.tsx:6:37
 import type { Meta, StoryObj } from '@storybook/react';
 import c from '../../styles/common.module.css';
 
-const meta: Meta<typeof VpButton> = {
-  title: 'VpButton',
-  component: VpButton,
-};
+const meta: Meta<typeof VpButton> = {};
 export default meta;
 

[NoCoverage] StringLiteral
src/common/vp-button/vp-button.stories.tsx:7:10
 import c from '../../styles/common.module.css';
 
 const meta: Meta<typeof VpButton> = {
-  title: 'VpButton',
+  title: "",
   component: VpButton,
 };

[NoCoverage] ArrowFunction
src/common/vp-button/vp-button.stories.tsx:15:11
 type Story = StoryObj<typeof VpButton>;
 
 export const Example: Story = {
-  render: () => (
-    <div className={c.centeredItem}>
-      <VpButton>Пример</VpButton>
-    </div>
-  ),
+  render: () => undefined,
 };
 

[NoCoverage] ArrowFunction
src/common/vp-button/vp-button.stories.tsx:23:11
 };
 
 export const Loading: Story = {
-  render: () => (
-    <div className={c.centeredItem}>
-      <VpButton loading>Пример</VpButton>
-    </div>
-  ),
+  render: () => undefined,
 };
 

[NoCoverage] ObjectLiteral
src/common/vp-button/vp-button.stories.tsx:30:32
   ),
 };
 
-export const Disabled: Story = {
-  render: () => (
-    <div className={c.centeredItem}>
-      <VpButton disabled>Пример</VpButton>
-    </div>
-  ),
-};
+export const Disabled: Story = {};
 

[NoCoverage] ArrowFunction
src/common/vp-button/vp-button.stories.tsx:31:11
 };
 
 export const Disabled: Story = {
-  render: () => (
-    <div className={c.centeredItem}>
-      <VpButton disabled>Пример</VpButton>
-    </div>
-  ),
+  render: () => undefined,
 };
 
