[NoCoverage] StringLiteral
src/common/vp-input/vp-input.stories.tsx:7:10
 import c from '../../styles/common.module.css';
 
 const meta: Meta<typeof VpInput> = {
-  title: 'VpInput',
+  title: "",
   component: VpInput,
 };

[NoCoverage] BlockStatement
src/common/vp-input/vp-input.stories.tsx:15:17
 type Story = StoryObj<typeof VpInput>;
 
 export const Example: Story = {
-  render: () => {
-    const [value, setValue] = useState('');
-
-    return (
-      <div className={c.centeredItem}>
-        <VpInput
-          value={value}
-          onChange={(e) => setValue(e.currentTarget.value)}
-        />
-      </div>
-    );
-  },
+  render: () => {},
 };
 

[NoCoverage] ArrowFunction
src/common/vp-input/vp-input.stories.tsx:22:21
       <div className={c.centeredItem}>
         <VpInput
           value={value}
-          onChange={(e) => setValue(e.currentTarget.value)}
+          onChange={() => undefined}
         />
       </div>

[NoCoverage] ArrowFunction
src/common/vp-input/vp-input.stories.tsx:30:11
 };
 
 export const Disabled: Story = {
-  render: () => (
-    <div className={c.centeredItem}>
-      <VpInput disabled value="test" />
-    </div>
-  ),
+  render: () => undefined,
 };
 
