[NoCoverage] BlockStatement
src/common/vp-selector/vp-select.stories.tsx:15:17
 type Story = StoryObj<typeof VpSelector>;
 
 export const Example: Story = {
-  render: () => {
-    const [value, setValue] = useState('');
-
-    return (
-      <div className={c.centeredItem}>
-        <VpSelector
-          value={value}
-          label="Выберите значение"
-          onChange={(e) => setValue(e.currentTarget.value)}
-        >
-          <option value="">Выберите значение</option>
-          <option value="1">Первое</option>
-          <option value="2">Второе</option>
-          <option value="3">Третье</option>
-        </VpSelector>
-      </div>
-    );
-  },
+  render: () => {},
 };
 

[NoCoverage] ArrowFunction
src/common/vp-selector/vp-select.stories.tsx:23:21
         <VpSelector
           value={value}
           label="Выберите значение"
-          onChange={(e) => setValue(e.currentTarget.value)}
+          onChange={() => undefined}
         >
           <option value="">Выберите значение</option>

[NoCoverage] ArrowFunction
src/common/vp-selector/vp-select.stories.tsx:36:11
 };
 
 export const Disabled: Story = {
-  render: () => (
-    <div className={c.centeredItem}>
-      <VpSelector disabled value="">
-        <option value="">Выберите значение</option>
-        <option value="1">Первое</option>
-        <option value="2">Второе</option>
-        <option value="3">Третье</option>
-      </VpSelector>
-    </div>
-  ),
+  render: () => undefined,
 };
 
