[Survived] ArithmeticOperator
features/game/game-net/game-net.tsx:15:17
 
   const net = useAppSelector(selectGameNet);
   const netYAxis = useAppSelector(selectGameNetYAxis);
-  const width = netYAxis * ELEMENT_SIZE;
+  const width = netYAxis / ELEMENT_SIZE;
 
   const handlePickElement = (x: number, y: number) => {

[NoCoverage] BlockStatement
features/game/game-net/game-net.tsx:17:55
   const netYAxis = useAppSelector(selectGameNetYAxis);
   const width = netYAxis * ELEMENT_SIZE;
 
-  const handlePickElement = (x: number, y: number) => {
-    dispatch(selectGameNetElement({ x, y }));
-  };
+  const handlePickElement = (x: number, y: number) => {};
 
   return (

[Survived] ArrowFunction
features/game/game-net/game-net.tsx:24:18
   return (
     <div className={s.gameNet}>
       <div className={s.net} style={{ width }}>
-        {net.map((rowArr, rowIdx, arr) =>
-          rowArr.map((_, colIdx) => {
-            const id = `${rowIdx}_${colIdx}`;
-            return (
-              <div
-                key={id}
-                id={id}
-                onClick={() => handlePickElement(rowIdx, colIdx)}
-                className={clsx(
-                  s.element,
-                  arr[rowIdx][colIdx] ? s.aliveElement : s.diedElement
-                )}
-              />
-            );
-          })
+        {net.map(() => undefined
         )}
       </div>

[Survived] BlockStatement
features/game/game-net/game-net.tsx:25:37
     <div className={s.gameNet}>
       <div className={s.net} style={{ width }}>
         {net.map((rowArr, rowIdx, arr) =>
-          rowArr.map((_, colIdx) => {
-            const id = `${rowIdx}_${colIdx}`;
-            return (
-              <div
-                key={id}
-                id={id}
-                onClick={() => handlePickElement(rowIdx, colIdx)}
-                className={clsx(
-                  s.element,
-                  arr[rowIdx][colIdx] ? s.aliveElement : s.diedElement
-                )}
-              />
-            );
-          })
+          rowArr.map((_, colIdx) => {})
         )}
       </div>

[Survived] ArrowFunction
features/game/game-net/game-net.tsx:31:26
               <div
                 key={id}
                 id={id}
-                onClick={() => handlePickElement(rowIdx, colIdx)}
+                onClick={() => undefined}
                 className={clsx(
                   s.element,
