[Survived] BlockStatement
features/game/game-settings/game-settings.tsx:33:26
   const net = useAppSelector(selectGameNet);
   const netSize = useAppSelector(selectGameNetSize);
 
-  const gameIsOn = () => {
-    dispatch(gameNextGeneration());
-    dispatch(increaseGameGeneration(1));
-  };
+  const gameIsOn = () => {};
 
   const handleStartGame = () => {

[Killed] BlockStatement
features/game/game-settings/game-settings.tsx:38:33
     dispatch(increaseGameGeneration(1));
   };
 
-  const handleStartGame = () => {
-    clearInterval(intervalRef.current);
-    dispatch(changeGameMode(GameModes.Start));
-    intervalRef.current = window.setInterval(gameIsOn, speed);
-  };
+  const handleStartGame = () => {};
 
   const handleStop = () => {
killedBy: GameScreen handleStartGame
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
features/game/game-settings/game-settings.tsx:44:28
     intervalRef.current = window.setInterval(gameIsOn, speed);
   };
 
-  const handleStop = () => {
-    dispatch(changeGameMode(GameModes.Pause));
-    clearInterval(intervalRef.current);
-  };
+  const handleStop = () => {};
 
   const handleReset = () => {
killedBy: GameScreen handleStop
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
features/game/game-settings/game-settings.tsx:49:29
     clearInterval(intervalRef.current);
   };
 
-  const handleReset = () => {
-    dispatch(resetGame());
-    clearInterval(intervalRef.current);
-  };
+  const handleReset = () => {};
 
   const handleRandomNet = () => {
killedBy: GameScreen handleReset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
features/game/game-settings/game-settings.tsx:54:33
     clearInterval(intervalRef.current);
   };
 
-  const handleRandomNet = () => {
-    const newNet = net.map((rowArr) =>
-      rowArr.map(() => Math.floor(Math.random() * 4) === 1)
-    );
-    dispatch(changeGameNet(newNet));
-  };
+  const handleRandomNet = () => {};
 
   const handleChangeNetSize = (e: ChangeEvent<HTMLSelectElement>) => {
killedBy: GameScreen handleRandomNet
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

[Killed] ArrowFunction
features/game/game-settings/game-settings.tsx:55:28
   };
 
   const handleRandomNet = () => {
-    const newNet = net.map((rowArr) =>
-      rowArr.map(() => Math.floor(Math.random() * 4) === 1)
+    const newNet = net.map(() => undefined
     );
     dispatch(changeGameNet(newNet));
killedBy: GameScreen handleRandomNet
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Survived] EqualityOperator
features/game/game-settings/game-settings.tsx:56:24
 
   const handleRandomNet = () => {
     const newNet = net.map((rowArr) =>
-      rowArr.map(() => Math.floor(Math.random() * 4) === 1)
+      rowArr.map(() => Math.floor(Math.random() * 4) !== 1)
     );
     dispatch(changeGameNet(newNet));

[Survived] ArithmeticOperator
features/game/game-settings/game-settings.tsx:56:35
 
   const handleRandomNet = () => {
     const newNet = net.map((rowArr) =>
-      rowArr.map(() => Math.floor(Math.random() * 4) === 1)
+      rowArr.map(() => Math.floor(Math.random() / 4) === 1)
     );
     dispatch(changeGameNet(newNet));

[Killed] BlockStatement
features/game/game-settings/game-settings.tsx:61:70
     dispatch(changeGameNet(newNet));
   };
 
-  const handleChangeNetSize = (e: ChangeEvent<HTMLSelectElement>) => {
-    const { value } = e.currentTarget;
-    dispatch(changeGameNetSize(value as GameNetSizes));
-  };
+  const handleChangeNetSize = (e: ChangeEvent<HTMLSelectElement>) => {};
 
   const handleChangeGameSpeed = (e: ChangeEvent<HTMLInputElement>) => {
killedBy: GameScreen handleChangeNetSize
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "lg"
Received: "sm"

[NoCoverage] BlockStatement
features/game/game-settings/game-settings.tsx:66:71
     dispatch(changeGameNetSize(value as GameNetSizes));
   };
 
-  const handleChangeGameSpeed = (e: ChangeEvent<HTMLInputElement>) => {
-    const { value } = e.currentTarget;
-    dispatch(changeGameSpeed(parseInt(value)));
-  };
+  const handleChangeGameSpeed = (e: ChangeEvent<HTMLInputElement>) => {};
 
   return (
