[Killed] ArrowFunction
src/features/game/game-slice.ts:33:16
   name: 'game',
   initialState: GAME_INITIAL_STATE,
   reducers: {
-    resetGame: () => GAME_INITIAL_STATE,
+    resetGame: () => undefined,
     gameNextGeneration: (state) => {
       if (state.mode === GameModes.Start) {
killedBy: GameScreen handleReset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] EqualityOperator
src/features/game/game-slice.ts:35:11
   reducers: {
     resetGame: () => GAME_INITIAL_STATE,
     gameNextGeneration: (state) => {
-      if (state.mode === GameModes.Start) {
+      if (state.mode !== GameModes.Start) {
         const storeNet = state.net;
         const netClone = cloneDeep(state.net);

[Survived] ConditionalExpression
src/features/game/game-slice.ts:35:11
   reducers: {
     resetGame: () => GAME_INITIAL_STATE,
     gameNextGeneration: (state) => {
-      if (state.mode === GameModes.Start) {
+      if (false) {
         const storeNet = state.net;
         const netClone = cloneDeep(state.net);

[Survived] BlockStatement
src/features/game/game-slice.ts:42:41
         const xAxis = GAME_FIELD_SIZES_INFO[state.netSize].x;
         const yAxis = GAME_FIELD_SIZES_INFO[state.netSize].y;
 
-        for (let i = 0; i < xAxis; i++) {
-          for (let j = 0; j < yAxis; j++) {
-            let count = 0;
-            if (i > 0) if (storeNet[i - 1][j]) count++;
-            if (i > 0 && j > 0) if (storeNet[i - 1][j - 1]) count++;
-            if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;
-            if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;
-            if (j > 0) if (storeNet[i][j - 1]) count++;
-            if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;
-            if (i < xAxis - 1 && j > 0) if (storeNet[i + 1][j - 1]) count++;
-            if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j + 1]) count++;
-            if (storeNet[i][j] && (count < 2 || count > 3))
-              netClone[i][j] = false;
-            if (!storeNet[i][j] && count === 3) netClone[i][j] = true;
-          }
-        }
+        for (let i = 0; i < xAxis; i++) {}
 
         state.net = netClone;

[Survived] ConditionalExpression
src/features/game/game-slice.ts:42:25
         const xAxis = GAME_FIELD_SIZES_INFO[state.netSize].x;
         const yAxis = GAME_FIELD_SIZES_INFO[state.netSize].y;
 
-        for (let i = 0; i < xAxis; i++) {
+        for (let i = 0; false; i++) {
           for (let j = 0; j < yAxis; j++) {
             let count = 0;

[Survived] EqualityOperator
src/features/game/game-slice.ts:43:27
         const yAxis = GAME_FIELD_SIZES_INFO[state.netSize].y;
 
         for (let i = 0; i < xAxis; i++) {
-          for (let j = 0; j < yAxis; j++) {
+          for (let j = 0; j <= yAxis; j++) {
             let count = 0;
             if (i > 0) if (storeNet[i - 1][j]) count++;

[Survived] EqualityOperator
src/features/game/game-slice.ts:43:27
         const yAxis = GAME_FIELD_SIZES_INFO[state.netSize].y;
 
         for (let i = 0; i < xAxis; i++) {
-          for (let j = 0; j < yAxis; j++) {
+          for (let j = 0; j >= yAxis; j++) {
             let count = 0;
             if (i > 0) if (storeNet[i - 1][j]) count++;

[Survived] ArithmeticOperator
src/features/game/game-slice.ts:45:37
         for (let i = 0; i < xAxis; i++) {
           for (let j = 0; j < yAxis; j++) {
             let count = 0;
-            if (i > 0) if (storeNet[i - 1][j]) count++;
+            if (i > 0) if (storeNet[i + 1][j]) count++;
             if (i > 0 && j > 0) if (storeNet[i - 1][j - 1]) count++;
             if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;

[Survived] ConditionalExpression
src/features/game/game-slice.ts:45:28
         for (let i = 0; i < xAxis; i++) {
           for (let j = 0; j < yAxis; j++) {
             let count = 0;
-            if (i > 0) if (storeNet[i - 1][j]) count++;
+            if (i > 0) if (true) count++;
             if (i > 0 && j > 0) if (storeNet[i - 1][j - 1]) count++;
             if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;

[Survived] ConditionalExpression
src/features/game/game-slice.ts:46:37
           for (let j = 0; j < yAxis; j++) {
             let count = 0;
             if (i > 0) if (storeNet[i - 1][j]) count++;
-            if (i > 0 && j > 0) if (storeNet[i - 1][j - 1]) count++;
+            if (i > 0 && j > 0) if (false) count++;
             if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;
             if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;

[Survived] EqualityOperator
src/features/game/game-slice.ts:46:26
           for (let j = 0; j < yAxis; j++) {
             let count = 0;
             if (i > 0) if (storeNet[i - 1][j]) count++;
-            if (i > 0 && j > 0) if (storeNet[i - 1][j - 1]) count++;
+            if (i > 0 && j >= 0) if (storeNet[i - 1][j - 1]) count++;
             if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;
             if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;

[Survived] EqualityOperator
src/features/game/game-slice.ts:47:26
             let count = 0;
             if (i > 0) if (storeNet[i - 1][j]) count++;
             if (i > 0 && j > 0) if (storeNet[i - 1][j - 1]) count++;
-            if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;
+            if (i > 0 && j <= yAxis - 1) if (storeNet[i - 1][j + 1]) count++;
             if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;
             if (j > 0) if (storeNet[i][j - 1]) count++;

[Survived] ArithmeticOperator
src/features/game/game-slice.ts:47:61
             let count = 0;
             if (i > 0) if (storeNet[i - 1][j]) count++;
             if (i > 0 && j > 0) if (storeNet[i - 1][j - 1]) count++;
-            if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;
+            if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j - 1]) count++;
             if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;
             if (j > 0) if (storeNet[i][j - 1]) count++;

[Survived] EqualityOperator
src/features/game/game-slice.ts:48:17
             if (i > 0) if (storeNet[i - 1][j]) count++;
             if (i > 0 && j > 0) if (storeNet[i - 1][j - 1]) count++;
             if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;
-            if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;
+            if (j <= yAxis - 1) if (storeNet[i][j + 1]) count++;
             if (j > 0) if (storeNet[i][j - 1]) count++;
             if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;

[Survived] ArithmeticOperator
src/features/game/game-slice.ts:48:21
             if (i > 0) if (storeNet[i - 1][j]) count++;
             if (i > 0 && j > 0) if (storeNet[i - 1][j - 1]) count++;
             if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;
-            if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;
+            if (j < yAxis + 1) if (storeNet[i][j + 1]) count++;
             if (j > 0) if (storeNet[i][j - 1]) count++;
             if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;

[Timeout] ArithmeticOperator
src/features/game/game-slice.ts:49:40
             if (i > 0 && j > 0) if (storeNet[i - 1][j - 1]) count++;
             if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;
             if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;
-            if (j > 0) if (storeNet[i][j - 1]) count++;
+            if (j > 0) if (storeNet[i][j + 1]) count++;
             if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;
             if (i < xAxis - 1 && j > 0) if (storeNet[i + 1][j - 1]) count++;

[Survived] ConditionalExpression
src/features/game/game-slice.ts:49:28
             if (i > 0 && j > 0) if (storeNet[i - 1][j - 1]) count++;
             if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;
             if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;
-            if (j > 0) if (storeNet[i][j - 1]) count++;
+            if (j > 0) if (false) count++;
             if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;
             if (i < xAxis - 1 && j > 0) if (storeNet[i + 1][j - 1]) count++;

[Survived] ConditionalExpression
src/features/game/game-slice.ts:50:17
             if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;
             if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;
             if (j > 0) if (storeNet[i][j - 1]) count++;
-            if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;
+            if (false) if (storeNet[i + 1][j]) count++;
             if (i < xAxis - 1 && j > 0) if (storeNet[i + 1][j - 1]) count++;
             if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j + 1]) count++;

[Timeout] EqualityOperator
src/features/game/game-slice.ts:50:17
             if (i > 0 && j < yAxis - 1) if (storeNet[i - 1][j + 1]) count++;
             if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;
             if (j > 0) if (storeNet[i][j - 1]) count++;
-            if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;
+            if (i <= xAxis - 1) if (storeNet[i + 1][j]) count++;
             if (i < xAxis - 1 && j > 0) if (storeNet[i + 1][j - 1]) count++;
             if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j + 1]) count++;

[Survived] EqualityOperator
src/features/game/game-slice.ts:51:34
             if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;
             if (j > 0) if (storeNet[i][j - 1]) count++;
             if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;
-            if (i < xAxis - 1 && j > 0) if (storeNet[i + 1][j - 1]) count++;
+            if (i < xAxis - 1 && j >= 0) if (storeNet[i + 1][j - 1]) count++;
             if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j + 1]) count++;
             if (storeNet[i][j] && (count < 2 || count > 3))

[Survived] ConditionalExpression
src/features/game/game-slice.ts:51:45
             if (j < yAxis - 1) if (storeNet[i][j + 1]) count++;
             if (j > 0) if (storeNet[i][j - 1]) count++;
             if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;
-            if (i < xAxis - 1 && j > 0) if (storeNet[i + 1][j - 1]) count++;
+            if (i < xAxis - 1 && j > 0) if (false) count++;
             if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j + 1]) count++;
             if (storeNet[i][j] && (count < 2 || count > 3))

[Survived] ConditionalExpression
src/features/game/game-slice.ts:52:49
             if (j > 0) if (storeNet[i][j - 1]) count++;
             if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;
             if (i < xAxis - 1 && j > 0) if (storeNet[i + 1][j - 1]) count++;
-            if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j + 1]) count++;
+            if (i < xAxis - 1 && yAxis - 1) if (false) count++;
             if (storeNet[i][j] && (count < 2 || count > 3))
               netClone[i][j] = false;

[Survived] ArithmeticOperator
src/features/game/game-slice.ts:52:65
             if (j > 0) if (storeNet[i][j - 1]) count++;
             if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;
             if (i < xAxis - 1 && j > 0) if (storeNet[i + 1][j - 1]) count++;
-            if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j + 1]) count++;
+            if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j - 1]) count++;
             if (storeNet[i][j] && (count < 2 || count > 3))
               netClone[i][j] = false;

[NoCoverage] LogicalOperator
src/features/game/game-slice.ts:53:36
             if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;
             if (i < xAxis - 1 && j > 0) if (storeNet[i + 1][j - 1]) count++;
             if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j + 1]) count++;
-            if (storeNet[i][j] && (count < 2 || count > 3))
+            if (storeNet[i][j] && (count < 2 && count > 3))
               netClone[i][j] = false;
             if (!storeNet[i][j] && count === 3) netClone[i][j] = true;

[Survived] ConditionalExpression
src/features/game/game-slice.ts:53:17
             if (i < xAxis - 1) if (storeNet[i + 1][j]) count++;
             if (i < xAxis - 1 && j > 0) if (storeNet[i + 1][j - 1]) count++;
             if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j + 1]) count++;
-            if (storeNet[i][j] && (count < 2 || count > 3))
+            if (false)
               netClone[i][j] = false;
             if (!storeNet[i][j] && count === 3) netClone[i][j] = true;

[NoCoverage] BooleanLiteral
src/features/game/game-slice.ts:54:32
             if (i < xAxis - 1 && j > 0) if (storeNet[i + 1][j - 1]) count++;
             if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j + 1]) count++;
             if (storeNet[i][j] && (count < 2 || count > 3))
-              netClone[i][j] = false;
+              netClone[i][j] = true;
             if (!storeNet[i][j] && count === 3) netClone[i][j] = true;
           }

[Survived] LogicalOperator
src/features/game/game-slice.ts:55:17
             if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j + 1]) count++;
             if (storeNet[i][j] && (count < 2 || count > 3))
               netClone[i][j] = false;
-            if (!storeNet[i][j] && count === 3) netClone[i][j] = true;
+            if (!storeNet[i][j] || count === 3) netClone[i][j] = true;
           }
         }

[Survived] EqualityOperator
src/features/game/game-slice.ts:55:36
             if (i < xAxis - 1 && yAxis - 1) if (storeNet[i + 1][j + 1]) count++;
             if (storeNet[i][j] && (count < 2 || count > 3))
               netClone[i][j] = false;
-            if (!storeNet[i][j] && count === 3) netClone[i][j] = true;
+            if (!storeNet[i][j] && count !== 3) netClone[i][j] = true;
           }
         }

[Killed] BlockStatement
src/features/game/game-slice.ts:62:71
         state.net = netClone;
       }
     },
-    changeGameMode: (state, { payload }: PayloadAction<GameModes>) => {
-      state.mode = payload;
-    },
+    changeGameMode: (state, { payload }: PayloadAction<GameModes>) => {},
     changeGameNetSize: (state, { payload }: PayloadAction<GameNetSizes>) => {
       state.mode = GameModes.Pause;
killedBy: GameScreen handleStartGame
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/features/game/game-slice.ts:65:77
     changeGameMode: (state, { payload }: PayloadAction<GameModes>) => {
       state.mode = payload;
     },
-    changeGameNetSize: (state, { payload }: PayloadAction<GameNetSizes>) => {
-      state.mode = GameModes.Pause;
-      state.generation = 0;
-      state.netSize = payload;
-      const xAxis = GAME_FIELD_SIZES_INFO[payload].x;
-      const yAxis = GAME_FIELD_SIZES_INFO[payload].y;
-      state.net = calculateNewNet(xAxis, yAxis);
-    },
+    changeGameNetSize: (state, { payload }: PayloadAction<GameNetSizes>) => {},
     changeGameSpeed: (state, { payload }: PayloadAction<number>) => {
       state.speed = payload;
killedBy: GameScreen handleChangeNetSize
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "lg"
Received: "sm"

[Killed] BlockStatement
src/features/game/game-slice.ts:73:69
       const yAxis = GAME_FIELD_SIZES_INFO[payload].y;
       state.net = calculateNewNet(xAxis, yAxis);
     },
-    changeGameSpeed: (state, { payload }: PayloadAction<number>) => {
-      state.speed = payload;
-    },
+    changeGameSpeed: (state, { payload }: PayloadAction<number>) => {},
     increaseGameGeneration: (state, { payload }: PayloadAction<number>) => {
       if (!payload) {
killedBy: GameSlice changeGameSpeed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 250

[Killed] BlockStatement
src/features/game/game-slice.ts:76:76
     changeGameSpeed: (state, { payload }: PayloadAction<number>) => {
       state.speed = payload;
     },
-    increaseGameGeneration: (state, { payload }: PayloadAction<number>) => {
-      if (!payload) {
-        state.generation = payload;
-        return;
-      }
-      state.generation += payload;
-    },
+    increaseGameGeneration: (state, { payload }: PayloadAction<number>) => {},
     changeGameNet: (state, { payload }: PayloadAction<boolean[][]>) => {
       state.net = payload;
killedBy: GameSlice increaseGameGeneration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] BooleanLiteral
src/features/game/game-slice.ts:77:11
       state.speed = payload;
     },
     increaseGameGeneration: (state, { payload }: PayloadAction<number>) => {
-      if (!payload) {
+      if (payload) {
         state.generation = payload;
         return;
killedBy: GameSlice increaseGameGeneration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 100

[Killed] ConditionalExpression
src/features/game/game-slice.ts:77:11
       state.speed = payload;
     },
     increaseGameGeneration: (state, { payload }: PayloadAction<number>) => {
-      if (!payload) {
+      if (false) {
         state.generation = payload;
         return;
killedBy: GameSlice increaseGameGeneration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 100

[Timeout] AssignmentOperator
src/features/game/game-slice.ts:81:7
         state.generation = payload;
         return;
       }
-      state.generation += payload;
+      state.generation -= payload;
     },
     changeGameNet: (state, { payload }: PayloadAction<boolean[][]>) => {

[Timeout] BlockStatement
src/features/game/game-slice.ts:83:72
       }
       state.generation += payload;
     },
-    changeGameNet: (state, { payload }: PayloadAction<boolean[][]>) => {
-      state.net = payload;
-    },
+    changeGameNet: (state, { payload }: PayloadAction<boolean[][]>) => {},
     selectGameNetElement: (state, { payload }: PayloadAction<NetElement>) => {
       const { x, y } = payload;

[Killed] BlockStatement
src/features/game/game-slice.ts:86:78
     changeGameNet: (state, { payload }: PayloadAction<boolean[][]>) => {
       state.net = payload;
     },
-    selectGameNetElement: (state, { payload }: PayloadAction<NetElement>) => {
-      const { x, y } = payload;
-      const newNet = [...state.net];
-      newNet[x][y] = !state.net[x][y];
-      state.net = newNet;
-    },
+    selectGameNetElement: (state, { payload }: PayloadAction<NetElement>) => {},
   },
 });
killedBy: GameSlice selectGameNetElement
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Timeout] ArrayDeclaration
src/features/game/game-slice.ts:88:22
     },
     selectGameNetElement: (state, { payload }: PayloadAction<NetElement>) => {
       const { x, y } = payload;
-      const newNet = [...state.net];
+      const newNet = [];
       newNet[x][y] = !state.net[x][y];
       state.net = newNet;

[Killed] BooleanLiteral
src/features/game/game-slice.ts:89:22
     selectGameNetElement: (state, { payload }: PayloadAction<NetElement>) => {
       const { x, y } = payload;
       const newNet = [...state.net];
-      newNet[x][y] = !state.net[x][y];
+      newNet[x][y] = state.net[x][y];
       state.net = newNet;
     },
killedBy: GameSlice selectGameNetElement
statusReason: Error: expect(received).toBeTruthy()

Received: false
