[Survived] StringLiteral
src/features/system/system-slice.ts:12:12
 };
 
 export const SYSTEM_INITIAL_STATE: SystemState = {
-  version: '',
+  version: "Stryker was here!",
   isAuth: false,
   userName: '',

[Killed] BooleanLiteral
src/features/system/system-slice.ts:13:11
 
 export const SYSTEM_INITIAL_STATE: SystemState = {
   version: '',
-  isAuth: false,
+  isAuth: true,
   userName: '',
 };
killedBy: App should render login page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="login-page-login-input"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <label

[Survived] StringLiteral
src/features/system/system-slice.ts:14:13
 export const SYSTEM_INITIAL_STATE: SystemState = {
   version: '',
   isAuth: false,
-  userName: '',
+  userName: "Stryker was here!",
 };
 

[Survived] ObjectLiteral
src/features/system/system-slice.ts:20:13
 const systemSlice = createSlice({
   name: 'system',
   initialState: SYSTEM_INITIAL_STATE,
-  reducers: {
-    loadVersion: (state, { payload }: PayloadAction<string>) => {
-      state.version = payload;
-    },
-  },
+  reducers: {},
   extraReducers(builder) {
     builder

[NoCoverage] BlockStatement
src/features/system/system-slice.ts:21:65
   name: 'system',
   initialState: SYSTEM_INITIAL_STATE,
   reducers: {
-    loadVersion: (state, { payload }: PayloadAction<string>) => {
-      state.version = payload;
-    },
+    loadVersion: (state, { payload }: PayloadAction<string>) => {},
   },
   extraReducers(builder) {

[Killed] BlockStatement
src/features/system/system-slice.ts:25:26
       state.version = payload;
     },
   },
-  extraReducers(builder) {
-    builder
-      .addCase(login.fulfilled, (state, { payload }: PayloadAction<string>) => {
-        state.isAuth = true;
-        state.userName = payload;
-      })
-      .addCase(logout.fulfilled, (state) => {
-        state.isAuth = false;
-        state.userName = '';
-      });
-  },
+  extraReducers(builder) {},
 });
 
killedBy: AppHeader should logout after click button
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Timeout] BlockStatement
src/features/system/system-slice.ts:27:80
   },
   extraReducers(builder) {
     builder
-      .addCase(login.fulfilled, (state, { payload }: PayloadAction<string>) => {
-        state.isAuth = true;
-        state.userName = payload;
-      })
+      .addCase(login.fulfilled, (state, { payload }: PayloadAction<string>) => {})
       .addCase(logout.fulfilled, (state) => {
         state.isAuth = false;

[Killed] BooleanLiteral
src/features/system/system-slice.ts:28:24
   extraReducers(builder) {
     builder
       .addCase(login.fulfilled, (state, { payload }: PayloadAction<string>) => {
-        state.isAuth = true;
+        state.isAuth = false;
         state.userName = payload;
       })
killedBy: LoginPage should auth after click button
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/features/system/system-slice.ts:31:45
         state.isAuth = true;
         state.userName = payload;
       })
-      .addCase(logout.fulfilled, (state) => {
-        state.isAuth = false;
-        state.userName = '';
-      });
+      .addCase(logout.fulfilled, (state) => {});
   },
 });
killedBy: AppHeader should logout after click button
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BooleanLiteral
src/features/system/system-slice.ts:32:24
         state.userName = payload;
       })
       .addCase(logout.fulfilled, (state) => {
-        state.isAuth = false;
+        state.isAuth = true;
         state.userName = '';
       });
killedBy: AppHeader should logout after click button
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] StringLiteral
src/features/system/system-slice.ts:33:26
       })
       .addCase(logout.fulfilled, (state) => {
         state.isAuth = false;
-        state.userName = '';
+        state.userName = "Stryker was here!";
       });
   },
killedBy: AppHeader should logout after click button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] BlockStatement
src/features/system/system-slice.ts:43:39
 
 export const login = createAsyncThunk(
   'system/login',
-  async (data: AuthenticationData) => {
-    const { name, password } = data;
-    if (!!name && !!password) {
-      localStorage.setItem(LocalStorageKeys.Authenticate, 'true');
-      localStorage.setItem(LocalStorageKeys.UserName, name);
-    }
-    return name;
-  }
+  async (data: AuthenticationData) => {}
 );
 
killedBy: LoginPage should auth after click button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "admin"
Received: undefined

[Killed] ConditionalExpression
src/features/system/system-slice.ts:45:9
   'system/login',
   async (data: AuthenticationData) => {
     const { name, password } = data;
-    if (!!name && !!password) {
+    if (false) {
       localStorage.setItem(LocalStorageKeys.Authenticate, 'true');
       localStorage.setItem(LocalStorageKeys.UserName, name);
killedBy: System slice login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "true"
Received: null

[Killed] BlockStatement
src/features/system/system-slice.ts:45:31
   'system/login',
   async (data: AuthenticationData) => {
     const { name, password } = data;
-    if (!!name && !!password) {
-      localStorage.setItem(LocalStorageKeys.Authenticate, 'true');
-      localStorage.setItem(LocalStorageKeys.UserName, name);
-    }
+    if (!!name && !!password) {}
     return name;
   }
killedBy: System slice login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "true"
Received: null

[Killed] StringLiteral
src/features/system/system-slice.ts:46:59
   async (data: AuthenticationData) => {
     const { name, password } = data;
     if (!!name && !!password) {
-      localStorage.setItem(LocalStorageKeys.Authenticate, 'true');
+      localStorage.setItem(LocalStorageKeys.Authenticate, "");
       localStorage.setItem(LocalStorageKeys.UserName, name);
     }
killedBy: System slice login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "true"
Received: null

[Survived] BlockStatement
src/features/system/system-slice.ts:53:69
   }
 );
 
-export const logout = createAsyncThunk('system/logout', async () => {
-  localStorage.clear();
-});
+export const logout = createAsyncThunk('system/logout', async () => {});
 
