[NoCoverage] StringLiteral
src/index.tsx:11:43
 import { getStateFromLocalStorage } from './common/common-utils';
 import { HelmetProvider } from 'react-helmet-async';
 
-const container = document.getElementById('root');
+const container = document.getElementById("");
 const root = createRoot(container!);
 const state = getStateFromLocalStorage();
