[Killed] BlockStatement
src/common/app-header/app-header.tsx:15:30
   const dispatch = useAppDispatch();
   const userName = useAppSelector(selectUserName);
 
-  const handleLogout = () => {
-    dispatch(logout());
-  };
+  const handleLogout = () => {};
 
   return (
killedBy: AppHeader should logout after click button
statusReason: Error: expect(received).toBeFalsy()

Received: true
