[Killed] ArrowFunction
src/app/app.tsx:10:23
 import { selectIsLogin } from '../features/system/system-selectors';
 import c from '../styles/common.module.css';
 
-const MainPage = lazy(() => import('../common/pages/main-page'));
+const MainPage = lazy(() => undefined);
 const LoginPage = lazy(() => import('../common/pages/login-page'));
 
killedBy: App should render main page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-header-user-name-label"]

Ignored nodes: comments, script, style
<body>
  <div>
    <span>
      Произошла ошибка
    </span>

[Killed] ArrowFunction
src/app/app.tsx:11:24
 import c from '../styles/common.module.css';
 
 const MainPage = lazy(() => import('../common/pages/main-page'));
-const LoginPage = lazy(() => import('../common/pages/login-page'));
+const LoginPage = lazy(() => undefined);
 
 const App = () => {
killedBy: App should render login page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="login-page-login-input"]

Ignored nodes: comments, script, style
<body>
  <div>
    <span>
      Произошла ошибка
    </span>

[Killed] BlockStatement
src/app/app.tsx:13:19
 const MainPage = lazy(() => import('../common/pages/main-page'));
 const LoginPage = lazy(() => import('../common/pages/login-page'));
 
-const App = () => {
-  const isAuth = useAppSelector(selectIsLogin);
-
-  return (
-    <ErrorBoundary>
-      <Suspense
-        fallback={<PacmanLoader color="darkred" className={c.centeredItem} />}
-      >
-        <Routes>
-          <Route
-            path={AppRoutes.Any}
-            element={isAuth ? <MainPage /> : <LoginPage />}
-          />
-        </Routes>
-      </Suspense>
-    </ErrorBoundary>
-  );
-};
+const App = () => {};
 
 export default App;
killedBy: App should render main page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-header-user-name-label"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
