[Killed] ArrowFunction
src/app/store.ts:6:33
 import logger from 'redux-logger';
 import { rootReducer } from './reducers';
 
-export const createAppReducer = () => rootReducer;
+export const createAppReducer = () => undefined;
 
 const reducer = createAppReducer();
killedBy: LoginPage should auth after click button
statusReason: Error: "reducer" is a required argument, and must be a function or an object of functions that can be passed to combineReducers

[Killed] ArrowFunction
src/app/store.ts:11:31
 const reducer = createAppReducer();
 export type RootState = ReturnType<typeof reducer>;
 
-export const createAppStore = (initialState?: Partial<RootState>) =>
-  configureStore({
-    reducer,
-    preloadedState: initialState,
-    devTools: process.env.NODE_ENV !== 'production',
-    middleware: (getDefaultMiddleware) => {
-      const defaultMiddlewares = getDefaultMiddleware();
-      return process.env.NODE_ENV === 'development'
-        ? defaultMiddlewares.concat(logger)
-        : defaultMiddlewares;
-    },
-  });
+export const createAppStore = () => undefined;
 
 export type AppStore = ReturnType<typeof createAppStore>;
killedBy: GameSlice resetGame
statusReason: TypeError: Cannot read properties of undefined (reading 'dispatch')

[Killed] ObjectLiteral
src/app/store.ts:12:18
 export type RootState = ReturnType<typeof reducer>;
 
 export const createAppStore = (initialState?: Partial<RootState>) =>
-  configureStore({
-    reducer,
-    preloadedState: initialState,
-    devTools: process.env.NODE_ENV !== 'production',
-    middleware: (getDefaultMiddleware) => {
-      const defaultMiddlewares = getDefaultMiddleware();
-      return process.env.NODE_ENV === 'development'
-        ? defaultMiddlewares.concat(logger)
-        : defaultMiddlewares;
-    },
-  });
+  configureStore({});
 
 export type AppStore = ReturnType<typeof createAppStore>;
killedBy: App should render main page
statusReason: Error: "reducer" is a required argument, and must be a function or an object of functions that can be passed to combineReducers

[Survived] ConditionalExpression
src/app/store.ts:15:15
   configureStore({
     reducer,
     preloadedState: initialState,
-    devTools: process.env.NODE_ENV !== 'production',
+    devTools: false,
     middleware: (getDefaultMiddleware) => {
       const defaultMiddlewares = getDefaultMiddleware();

[Survived] EqualityOperator
src/app/store.ts:15:15
   configureStore({
     reducer,
     preloadedState: initialState,
-    devTools: process.env.NODE_ENV !== 'production',
+    devTools: process.env.NODE_ENV === 'production',
     middleware: (getDefaultMiddleware) => {
       const defaultMiddlewares = getDefaultMiddleware();

[Killed] BlockStatement
src/app/store.ts:16:43
     reducer,
     preloadedState: initialState,
     devTools: process.env.NODE_ENV !== 'production',
-    middleware: (getDefaultMiddleware) => {
-      const defaultMiddlewares = getDefaultMiddleware();
-      return process.env.NODE_ENV === 'development'
-        ? defaultMiddlewares.concat(logger)
-        : defaultMiddlewares;
-    },
+    middleware: (getDefaultMiddleware) => {},
   });
 
killedBy: App should render main page
statusReason: Error: when using a middleware builder function, an array of middleware must be returned

[Survived] ConditionalExpression
src/app/store.ts:18:14
     devTools: process.env.NODE_ENV !== 'production',
     middleware: (getDefaultMiddleware) => {
       const defaultMiddlewares = getDefaultMiddleware();
-      return process.env.NODE_ENV === 'development'
+      return false
         ? defaultMiddlewares.concat(logger)
         : defaultMiddlewares;

[Survived] EqualityOperator
src/app/store.ts:18:14
     devTools: process.env.NODE_ENV !== 'production',
     middleware: (getDefaultMiddleware) => {
       const defaultMiddlewares = getDefaultMiddleware();
-      return process.env.NODE_ENV === 'development'
+      return process.env.NODE_ENV !== 'development'
         ? defaultMiddlewares.concat(logger)
         : defaultMiddlewares;

[Killed] ArrowFunction
src/app/store.ts:26:31
 
 export type AppStore = ReturnType<typeof createAppStore>;
 export type AppDispatch = ReturnType<typeof createAppStore>['dispatch'];
-export const useAppDispatch = () => useDispatch<AppDispatch>();
+export const useAppDispatch = () => undefined;
 export const useAppSelector: TypedUseSelectorHook<RootState> = useSelector;
 
killedBy: LoginPage should auth after click button
statusReason: TypeError: dispatch is not a function
