[Survived] ArrowFunction
common/pages/main-page/main-page.tsx:5:18
 import AppContent from '../../app-content';
 import AppHeader from '../../app-header';
 
-const MainPage = () => (
-  <>
-    <AppHeader />
-    <div>
-      <AppContent />
-    </div>
-  </>
-);
+const MainPage = () => undefined;
 
 export default MainPage;
