[Killed] ArrowFunction
src/common/vp-selector/vp-selector.tsx:11:31
   className?: string;
 };
 
-const VpSelector: FC<Props> = ({
-  children,
-  label,
-  error,
-  className,
-  ...restProps
-}) => (
-  <div className={clsx(s.vpSelectBlock, className)}>
-    {label && <label className={s.vpSelectLabel}>{label}</label>}
-    <select className={s.vpSelect} {...restProps}>
-      {children}
-    </select>
-    {error && <pre className={s.vpSelectError}>{error}</pre>}
-  </div>
-);
+const VpSelector: FC<Props> = () => undefined;
 
 export default VpSelector;
killedBy: GameScreen should render component
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="game-settings-select-net-size"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div>

[Killed] ConditionalExpression
src/common/vp-selector/vp-selector.tsx:19:6
   ...restProps
 }) => (
   <div className={clsx(s.vpSelectBlock, className)}>
-    {label && <label className={s.vpSelectLabel}>{label}</label>}
+    {false}
     <select className={s.vpSelect} {...restProps}>
       {children}
killedBy: VpSelector should render select with label
statusReason: TestingLibraryElementError: Unable to find an element with the text: Выберите значение. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class=""
    >

[Killed] ConditionalExpression
src/common/vp-selector/vp-selector.tsx:19:6
   ...restProps
 }) => (
   <div className={clsx(s.vpSelectBlock, className)}>
-    {label && <label className={s.vpSelectLabel}>{label}</label>}
+    {true}
     <select className={s.vpSelect} {...restProps}>
       {children}
killedBy: VpSelector should render select with label
statusReason: TestingLibraryElementError: Unable to find an element with the text: Выберите значение. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class=""
    >

[Killed] ConditionalExpression
src/common/vp-selector/vp-selector.tsx:23:6
     <select className={s.vpSelect} {...restProps}>
       {children}
     </select>
-    {error && <pre className={s.vpSelectError}>{error}</pre>}
+    {true}
   </div>
 );
killedBy: VpSelector should render select with error
statusReason: TestingLibraryElementError: Unable to find an element with the text: Значение не выбрано. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class=""
    >

[Killed] ConditionalExpression
src/common/vp-selector/vp-selector.tsx:23:6
     <select className={s.vpSelect} {...restProps}>
       {children}
     </select>
-    {error && <pre className={s.vpSelectError}>{error}</pre>}
+    {false}
   </div>
 );
killedBy: VpSelector should render select with error
statusReason: TestingLibraryElementError: Unable to find an element with the text: Значение не выбрано. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class=""
    >
