[Killed] ArrowFunction
src/common/vp-input/vp-input.tsx:11:28
   className?: string;
 };
 
-const VpInput: FC<Props> = ({ label, error, className, ...restProps }) => (
-  <div className={clsx(s.vpInputBlock, className)}>
-    {label && <label className={s.vpInputLabel}>{label}</label>}
-    <input {...restProps} className={s.vpInput} />
-    {error && <pre className={s.vpInputError}>{error}</pre>}
-  </div>
-);
+const VpInput: FC<Props> = () => undefined;
 
 export default VpInput;
killedBy: LoginPage should render login page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="login-page-login-input"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <button

[Killed] ConditionalExpression
src/common/vp-input/vp-input.tsx:13:6
 
 const VpInput: FC<Props> = ({ label, error, className, ...restProps }) => (
   <div className={clsx(s.vpInputBlock, className)}>
-    {label && <label className={s.vpInputLabel}>{label}</label>}
+    {true}
     <input {...restProps} className={s.vpInput} />
     {error && <pre className={s.vpInputError}>{error}</pre>}
killedBy: VpInput should render input with label
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Логин/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class=""
    >

[Killed] ConditionalExpression
src/common/vp-input/vp-input.tsx:13:6
 
 const VpInput: FC<Props> = ({ label, error, className, ...restProps }) => (
   <div className={clsx(s.vpInputBlock, className)}>
-    {label && <label className={s.vpInputLabel}>{label}</label>}
+    {false}
     <input {...restProps} className={s.vpInput} />
     {error && <pre className={s.vpInputError}>{error}</pre>}
killedBy: VpInput should render input with label
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Логин/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class=""
    >

[Killed] ConditionalExpression
src/common/vp-input/vp-input.tsx:15:6
   <div className={clsx(s.vpInputBlock, className)}>
     {label && <label className={s.vpInputLabel}>{label}</label>}
     <input {...restProps} className={s.vpInput} />
-    {error && <pre className={s.vpInputError}>{error}</pre>}
+    {true}
   </div>
 );
killedBy: LoginPage should return validation errors on inputs
statusReason: TestingLibraryElementError: Unable to find an element with the text: Необходимо заполнить данное поле. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div

[Killed] ConditionalExpression
src/common/vp-input/vp-input.tsx:15:6
   <div className={clsx(s.vpInputBlock, className)}>
     {label && <label className={s.vpInputLabel}>{label}</label>}
     <input {...restProps} className={s.vpInput} />
-    {error && <pre className={s.vpInputError}>{error}</pre>}
+    {false}
   </div>
 );
killedBy: LoginPage should return validation errors on inputs
statusReason: TestingLibraryElementError: Unable to find an element with the text: Необходимо заполнить данное поле. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div
