[Killed] ArrowFunction
src/common/vp-button/vp-button.tsx:12:29
 
 export const SPINNER_TEST_ID = 'vp-button-spinner';
 
-const VpButton: FC<Props> = ({
-  children,
-  loading,
-  className,
-  ...restProps
-}) => (
-  <button className={clsx(s.vpButton, className)} {...restProps}>
-    {loading && (
-      <ClipLoader
-        size={15}
-        className={s.loader}
-        color="white"
-        data-testid={SPINNER_TEST_ID}
-      />
-    )}
-    {children}
-  </button>
-);
+const VpButton: FC<Props> = () => undefined;
 
 export default VpButton;
killedBy: AppHeader should render app header
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-header-game-button-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <label

[Killed] LogicalOperator
src/common/vp-button/vp-button.tsx:19:6
   ...restProps
 }) => (
   <button className={clsx(s.vpButton, className)} {...restProps}>
-    {loading && (
-      <ClipLoader
-        size={15}
-        className={s.loader}
-        color="white"
-        data-testid={SPINNER_TEST_ID}
-      />
-    )}
+    {loading || <ClipLoader size={15} className={s.loader} color="white" data-testid={SPINNER_TEST_ID} />}
     {children}
   </button>
killedBy: LoginPage should auth after click button
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="vp-button-spinner"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div

[Killed] ConditionalExpression
src/common/vp-button/vp-button.tsx:19:6
   ...restProps
 }) => (
   <button className={clsx(s.vpButton, className)} {...restProps}>
-    {loading && (
-      <ClipLoader
-        size={15}
-        className={s.loader}
-        color="white"
-        data-testid={SPINNER_TEST_ID}
-      />
-    )}
+    {true}
     {children}
   </button>
killedBy: LoginPage should auth after click button
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="vp-button-spinner"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div
