[Killed] BlockStatement
features/game/game-card/game-card.tsx:5:28
 import GameSettings from '../game-settings';
 import GameNet from '../game-net';
 
-const GameCard: FC = () => {
-  return (
-    <div>
-      <GameSettings />
-      <GameNet />
-    </div>
-  );
-};
+const GameCard: FC = () => {};
 
 export default GameCard;
killedBy: GameScreen should render component
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="game-settings-start-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div />
  </div>
</body>
