[Killed] BlockStatement
features/rules/rules-screen/rules-screen.tsx:6:31
 import RulesCard from '../rules-card';
 import Common from '../../../styles/common.module.css';
 
-const RulesScreen: FC = () => {
-  return (
-    <div className={Common.fluidContainer}>
-      <Helmet>
-        <title>Правила игры</title>
-      </Helmet>
-      <RulesCard />
-    </div>
-  );
-};
+const RulesScreen: FC = () => {};
 
 export default RulesScreen;
killedBy: RulesScreen should render component
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Правила/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
