[Killed] ArrowFunction
features/game/game-screen/game-screen.tsx:6:24
 import { Helmet } from 'react-helmet-async';
 import GameCard from '../game-card';
 
-const GameScreen: FC = () => (
-  <div className={c.fluidContainer}>
-    <Helmet>
-      <title>Игра</title>
-    </Helmet>
-    <GameCard />
-  </div>
-);
+const GameScreen: FC = () => undefined;
 
 export default GameScreen;
killedBy: GameScreen should render component
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="game-settings-start-button"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
