[Killed] ObjectLiteral
src/app/reducers.ts:5:44
 import { systemReducer } from '../features/system/system-slice';
 import { gameReducer } from '../features/game/game-slice';
 
-export const rootReducer = combineReducers({
-  system: systemReducer,
-  game: gameReducer,
-});
+export const rootReducer = combineReducers({});
 
killedBy: LoginPage should auth after click button
statusReason: TypeError: Cannot read properties of undefined (reading 'isAuth')
