[Killed] ArrowFunction
src/features/game/game-selectors.ts:5:25
 import { RootState } from '../../app/store';
 import { GAME_FIELD_SIZES_INFO } from './game-types';
 
-const selectGameState = (state: RootState) => state.game;
+const selectGameState = () => undefined;
 
 export const selectGameMode = createSelector(
killedBy: GameScreen should render component
statusReason: TypeError: Cannot read properties of undefined (reading 'generation')

[Survived] ArrowFunction
src/features/game/game-selectors.ts:9:3
 
 export const selectGameMode = createSelector(
   [selectGameState],
-  ({ mode }) => mode
+  () => undefined
 );
 export const selectGameNetSize = createSelector(

[Killed] ArrowFunction
src/features/game/game-selectors.ts:13:3
 );
 export const selectGameNetSize = createSelector(
   [selectGameState],
-  ({ netSize }) => netSize
+  () => undefined
 );
 export const selectGameNetXAxis = createSelector(
killedBy: GameScreen should render component
statusReason: TypeError: Cannot read properties of undefined (reading 'y')

[Survived] ArrayDeclaration
src/features/game/game-selectors.ts:16:3
   ({ netSize }) => netSize
 );
 export const selectGameNetXAxis = createSelector(
-  [selectGameNetSize],
+  [],
   (netSize) => GAME_FIELD_SIZES_INFO[netSize].x
 );

[Survived] ArrowFunction
src/features/game/game-selectors.ts:17:3
 );
 export const selectGameNetXAxis = createSelector(
   [selectGameNetSize],
-  (netSize) => GAME_FIELD_SIZES_INFO[netSize].x
+  () => undefined
 );
 export const selectGameNetYAxis = createSelector(

[Survived] ArrowFunction
src/features/game/game-selectors.ts:21:3
 );
 export const selectGameNetYAxis = createSelector(
   [selectGameNetSize],
-  (netSize) => GAME_FIELD_SIZES_INFO[netSize].y
+  () => undefined
 );
 export const selectGameSpeed = createSelector(

[Killed] ArrayDeclaration
src/features/game/game-selectors.ts:24:3
   (netSize) => GAME_FIELD_SIZES_INFO[netSize].y
 );
 export const selectGameSpeed = createSelector(
-  [selectGameState],
+  [],
   ({ speed }) => speed
 );
killedBy: GameScreen should render component
statusReason: TypeError: Cannot read properties of undefined (reading 'speed')

[Survived] ArrowFunction
src/features/game/game-selectors.ts:25:3
 );
 export const selectGameSpeed = createSelector(
   [selectGameState],
-  ({ speed }) => speed
+  () => undefined
 );
 export const selectGameNet = createSelector(

[Killed] ArrayDeclaration
src/features/game/game-selectors.ts:28:3
   ({ speed }) => speed
 );
 export const selectGameNet = createSelector(
-  [selectGameState],
+  [],
   ({ net }) => net
 );
killedBy: GameScreen should render component
statusReason: TypeError: Cannot read properties of undefined (reading 'net')

[Killed] ArrowFunction
src/features/game/game-selectors.ts:29:3
 );
 export const selectGameNet = createSelector(
   [selectGameState],
-  ({ net }) => net
+  () => undefined
 );
 export const selectGameGeneration = createSelector(
killedBy: GameScreen should render component
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Survived] ArrowFunction
src/features/game/game-selectors.ts:33:3
 );
 export const selectGameGeneration = createSelector(
   [selectGameState],
-  ({ generation }) => generation
+  () => undefined
 );
 
