[Killed] ArrowFunction
src/common/common-utils/game.ts:1:32
-export const calculateNewNet = (rows: number, columns: number): boolean[][] =>
-  Array(rows)
-    .fill(false)
-    .map(() => Array(columns).fill(false));
+export const calculateNewNet = () => undefined;
 
killedBy: GameScreen should render component
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrayDeclaration
src/common/common-utils/game.ts:2:3
 export const calculateNewNet = (rows: number, columns: number): boolean[][] =>
-  Array(rows)
+  Array()
     .fill(false)
     .map(() => Array(columns).fill(false));
killedBy: GameScreen handleChangeNetSize
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Survived] BooleanLiteral
src/common/common-utils/game.ts:3:11
 export const calculateNewNet = (rows: number, columns: number): boolean[][] =>
   Array(rows)
-    .fill(false)
+    .fill(true)
     .map(() => Array(columns).fill(false));
 

[Killed] ArrowFunction
src/common/common-utils/game.ts:4:10
 export const calculateNewNet = (rows: number, columns: number): boolean[][] =>
   Array(rows)
     .fill(false)
-    .map(() => Array(columns).fill(false));
+    .map(() => undefined);
 
killedBy: GameSlice selectGameNetElement
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] BooleanLiteral
src/common/common-utils/game.ts:4:36
 export const calculateNewNet = (rows: number, columns: number): boolean[][] =>
   Array(rows)
     .fill(false)
-    .map(() => Array(columns).fill(false));
+    .map(() => Array(columns).fill(true));
 
killedBy: GameSlice selectGameNetElement
statusReason: Error: expect(received).toBeTruthy()

Received: false
