[Killed] ArrowFunction
src/features/system/system-selectors.ts:4:27
 import { RootState } from '@/app/store';
 import { createSelector } from '@reduxjs/toolkit';
 
-const selectSystemState = (state: RootState) => state.system;
+const selectSystemState = () => undefined;
 
 export const selectVersion = createSelector(
killedBy: App should render main page
statusReason: TypeError: Cannot read properties of undefined (reading 'isAuth')

[Survived] ArrayDeclaration
src/features/system/system-selectors.ts:7:3
 const selectSystemState = (state: RootState) => state.system;
 
 export const selectVersion = createSelector(
-  [selectSystemState],
+  [],
   ({ version }) => version
 );

[Survived] ArrowFunction
src/features/system/system-selectors.ts:8:3
 
 export const selectVersion = createSelector(
   [selectSystemState],
-  ({ version }) => version
+  () => undefined
 );
 

[Killed] ArrowFunction
src/features/system/system-selectors.ts:13:3
 
 export const selectIsLogin = createSelector(
   [selectSystemState],
-  ({ isAuth }) => isAuth
+  () => undefined
 );
 
killedBy: App should render main page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-header-user-name-label"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div>
        <div

[Killed] ArrowFunction
src/features/system/system-selectors.ts:18:3
 
 export const selectUserName = createSelector(
   [selectSystemState],
-  ({ userName }) => userName
+  () => undefined
 );
 
killedBy: App should render main page
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  admin
Received:
