[Survived] ObjectLiteral
src/features/game/game-types.ts:19:25
 export const GAME_FIELD_SIZES_INFO = Object.freeze({
   [GameNetSizes.Small]: { x: DEFAULT_XAXIS, y: DEFAULT_YAXIS },
   [GameNetSizes.Medium]: { x: 30, y: 30 },
-  [GameNetSizes.Large]: { x: 45, y: 45 },
+  [GameNetSizes.Large]: {},
 });
 
